; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v1)
		(pred_2 ?v3)
		(pred_4 ?v7)
		(pred_5 ?v7)
		(pred_6 ?v3 ?v7)
		(pred_1)
		(pred_3 ?v3))

   (:action op_1
       :parameters  (?v6 ?v2)
       :precondition (and (not-eq ?v6 ?v2) 
                          (pred_4 ?v6) (pred_4 ?v2) (pred_5 ?v6))
       :effect (and  (pred_5 ?v2)
		     (not (pred_5 ?v6))))


   (:action op_3
       :parameters (?v4 ?v5)
       :precondition  (and  (pred_2 ?v4) (pred_4 ?v5)
			    (pred_6 ?v4 ?v5) (pred_5 ?v5) (pred_1))
       :effect (and (pred_3 ?v4)
		    (not (pred_6 ?v4 ?v5)) 
		    (not (pred_1))))

   (:action op_2
       :parameters  (?v4  ?v5)
       :precondition  (and  (pred_2 ?v4) (pred_4 ?v5)
			    (pred_3 ?v4) (pred_5 ?v5))
       :effect (and (pred_6 ?v4 ?v5)
		    (pred_1)
		    (not (pred_3 ?v4)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_05 obj_06 obj_03 obj_08 obj_04 obj_07 
          obj_02 obj_01 
)
(:init
(pred_4 obj_05)
(pred_4 obj_06)
(pred_4 obj_03)
(pred_4 obj_08)
(pred_4 obj_04)
(pred_4 obj_07)
(pred_2 obj_02)
(pred_2 obj_01)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(pred_1)
(pred_6 obj_02 obj_07)
(pred_6 obj_01 obj_05)
(pred_5 obj_04)
)
(:goal
(and
(pred_6 obj_02 obj_03)
(pred_6 obj_01 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_02 obj_03) (pred_5 obj_05))
    (sometime-before  (pred_6 obj_01 obj_04) (pred_5 obj_06))
  )
)
)

; plan
1. (op_1 obj_04 obj_07)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_07)
   goals met: 0 of 2
2. (op_3 obj_02 obj_07)
   deleted: (pred_6 obj_02 obj_07) (pred_1)
   added: (pred_3 obj_02)
   goals met: 0 of 2
3. (op_1 obj_07 obj_06)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_06)
   goals met: 0 of 2
4. (op_2 obj_02 obj_06)
   deleted: (pred_3 obj_02)
   added: (pred_6 obj_02 obj_06) (pred_1)
   goals met: 0 of 2
5. (op_1 obj_06 obj_05)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_05)
   goals met: 0 of 2
6. (op_3 obj_01 obj_05)
   deleted: (pred_6 obj_01 obj_05) (pred_1)
   added: (pred_3 obj_01)
   goals met: 0 of 2
7. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_04)
   goals met: 0 of 2
8. (op_2 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_6 obj_01 obj_04) (pred_1)
   goals met: 1 of 2
9. (op_1 obj_04 obj_06)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_06)
   goals met: 1 of 2
10. (op_3 obj_02 obj_06)
   deleted: (pred_6 obj_02 obj_06) (pred_1)
   added: (pred_3 obj_02)
   goals met: 1 of 2
11. (op_1 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 1 of 2
12. (op_2 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_6 obj_02 obj_03) (pred_1)
   goals met: 2 of 2
